def get_label_name(dataset_type, disease, crop, area):
    if dataset_type == "greenhouse_crop_disease":
        key = "{}_{}_{}".format(greenhouse_crop_disease[disease], greenhouse_crops[crop], greenhouse_areas[area])
        if key not in greenhouse_labels_dict:
            return None
        return greenhouse_labels_dict[key]


greenhouse_labels = [
    '정상_가지_잎',
    '정상_가지_줄기',
    '정상_고추_잎',
    '정상_단호박_잎',
    '정상_딸기_잎',
    '정상_딸기_열매',
    '정상_딸기_꽃',
    '정상_딸기_줄기',
    '정상_상추_잎',
    '정상_수박_잎',
    '정상_애호박_잎',
    '정상_오이_잎',
    '정상_쥬키니호박_잎',
    '정상_참외_잎',
    '정상_토마토_잎',
    '정상_포도_잎',
    '가지잎곰팡이병_가지_잎',
    '가지흰가루병_가지_잎',
    '가지흰가루병_가지_줄기',
    '고추마일드모틀바이러스_고추_잎',
    '고추점무늬병_고추_잎',
    '단호박점무늬병_단호박_잎',
    '단호박흰가루병_단호박_잎',
    '딸기잿빛곰팡이병_딸기_잎',
    '딸기흰가루병_딸기_잎',
    '딸기잿빛곰팡이병_딸기_열매',
    '딸기흰가루병_딸기_열매',
    '딸기잿빛곰팡이병_딸기_꽃',
    '딸기흰가루병_딸기_꽃',
    '딸기잿빛곰팡이병_딸기_줄기',
    '딸기흰가루병_딸기_줄기',
    '상추균핵병_상추_잎',
    '상추노균병_상추_잎',
    '수박탄저병_수박_잎',
    '수박흰가루병_수박_잎',
    '애호박점무늬병_애호박_잎',
    '오이모자이크바이러스_오이_잎',
    '오이녹반모자이크바이러스_쥬키니호박_잎',
    '참외노균병_참외_잎',
    '참외흰가루병_참외_잎',
    '토마토잎곰팡이병_토마토_잎',
    '토마토황화잎말이바이러스_토마토_잎',
    '포도노균병_포도_잎',
]
greenhouse_labels_dict = {l: i + 1 for i, l in enumerate(greenhouse_labels)}
greenhouse_crop_disease = [
    '정상',
    '가지잎곰팡이병',
    '가지흰가루병',
    '고추마일드모틀바이러스',
    '고추점무늬병',
    '단호박점무늬병',
    '단호박흰가루병',
    '딸기잿빛곰팡이병',
    '딸기흰가루병',
    '상추균핵병',
    '상추노균병',
    '수박탄저병',
    '수박흰가루병',
    '애호박점무늬병',
    '오이녹반모자이크바이러스',
    '오이모자이크바이러스',
    '참외노균병',
    '참외흰가루병',
    '토마토잎곰팡이병',
    '토마토황화잎말이바이러스',
    '포도노균병',
]
greenhouse_crops = [
    '작물없음',
    '가지',
    '고추',
    '단호박',
    '딸기',
    '상추',
    '수박',
    '애호박',
    '오이',
    '쥬키니호박',
    '참외',
    '토마토',
    '포도'
]

greenhouse_areas = [
    '구분없음',
    '열매',
    '꽃',
    '잎',
    '가지',
    '줄기',
    '뿌리',
    '해충'
]
